In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

In [4]:
df = pd.read_csv('titanic_toy.csv')

In [5]:
df.head()

    Age     Fare  Family  Survived
0  22.0   7.2500       1         0
1  38.0  71.2833       1         1
2  26.0   7.9250       0         1
3  35.0  53.1000       1         1
4  35.0   8.0500       0         0

In [6]:
df.isnull().mean()*100

Age         19.865320
Fare         5.050505
Family       0.000000
Survived     0.000000
dtype: float64

In [7]:
x = df.drop(columns=['Survived']) 
y = df['Survived']

In [10]:
x

      Age     Fare  Family
0    22.0   7.2500       1
1    38.0  71.2833       1
2    26.0   7.9250       0
3    35.0  53.1000       1
4    35.0   8.0500       0
..    ...      ...     ...
886  27.0  13.0000       0
887  19.0  30.0000       0
888   NaN  23.4500       3
889  26.0      NaN       0
890  32.0   7.7500       0

[891 rows x 3 columns]

In [11]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [8]:
x_train, x_test, y_train, y_test = train_test_split(
    x, y, test_size=0.2, random_state=2)

In [9]:
x_train.shape, x_test.shape

((712, 3), (179, 3))

In [10]:
mean_age = x_train['Age'].mean()
median_age = x_train['Age'].median()

mean_fare = x_train['Fare'].mean()
median_fare = x_train['Fare'].median()

In [11]:
x_train['Age_median'] = x_train['Age'].fillna(median_age)
x_train['Age_mean'] = x_train['Age'].fillna(mean_age)

x_train['Fare_mean'] = x_train['Fare'].fillna(mean_fare)
x_train['Fare_median'] = x_train['Fare'].fillna(median_fare)

In [ ]:
x_train.sample(10)

      Age     Fare  Family  Age_median   Age_mean  Fare_mean  Fare_median
165   9.0  20.5250       2        9.00   9.000000  20.525000      20.5250
188  40.0  15.5000       2       40.00  40.000000  15.500000      15.5000
336  29.0      NaN       1       29.00  29.000000  32.617597      14.4583
610  39.0  31.2750       6       39.00  39.000000  31.275000      31.2750
577  39.0  55.9000       1       39.00  39.000000  55.900000      55.9000
598   NaN   7.2250       0       28.75  29.785904   7.225000       7.2250
620  27.0  14.4542       1       27.00  27.000000  14.454200      14.4542
19    NaN   7.2250       0       28.75  29.785904   7.225000       7.2250
832   NaN   7.2292       0       28.75  29.785904   7.229200       7.2292
787   8.0  29.1250       5        8.00   8.000000  29.125000      29.1250

In [17]:
print("Orginal Age variable variance: ", x_train['Age'].var())
print("Age variable variance after mean imputation: ", x_train['Age_mean'].var())
print("Age variable variance after median imputation: ", x_train['Age_median'].var())

print("Orginal Fare variable variance: ", x_train['Fare'].var())
print("Fare variable variance after mean imputation: ", x_train['Fare_mean'].var())
print("Fare variable variance after median imputation: ", x_train['Fare_median'].var())

Orginal Age variable variance:  204.34951339046142
Age variable variance after mean imputation:  161.81262452718676
Age variable variance after median imputation:  161.98956633460548
Orginal Fare variable variance:  2448.1979137063163
Fare variable variance after mean imputation:  2324.2385256705534
Fare variable variance after median imputation:  2340.09102197536